let coursesData = [
    {
        id: 1,
        title: "20 Libs for js devs",
        price: 290_000, img: '/images/20libs.png', description: `امروزه کتابخانه‌ها کد نویسی را خیلی آسان و لذت بخش تر کرده اند. به قدری که حتی امروزه هیچ شرکت برنامه نویسی پروژه های خود را با Vanilla Js پیاده سازی نمی کند و همیشه از کتابخانه ها و فریمورک های موجود استفاده می کند. پس شما هم اگه میخواید یک برنامه نویس عالی فرانت اند باشید، باید کتابخانه های کاربردی که در بازار کار استفاده می شوند را به خوبی بلد باشید`
    },

    {
        id: 2,
        title: "React Course", price: 2_000_000, img: '/images/react.png', description: `شما در دوره آموزش ReactJS ، این کتابخانه قدرتمند و پر استفاده جاوا اسکریپت را بر اساس تجربیات مدرس در دنیای واقعی و کار با شرکت های مختلف ایرانی یاد می گیرید و مدرس دوره از نقطه صفر تا رسیدن شما به مرحله پیاده سازی نمونه کار، طراحی رزومه و … استخدام همراه شما خواهد بود و نمونه کارها و رزومه شما و خیلی از موارد دیگه توسط مدرس بررسی، راهنمایی و رفع اشکال خواهد شد تا شما عزیزان بتوانید نهایت خروجی را از این دوره به دست آورده و بعد از گذروندن این دوره وارد بازار کار شده و کسب درآمد کنید.`
    },

    {
        id: 3,
        title: "Npm For Js Devs", price: "Free", img: '/images/npm.png', description: `به صورت خلاصه، NPM یک پکیج منیجر است. در اصل نود جی اس یک پکیج منیجر به اسم NPM دارد. زمانی که شما Node Js را نصب می کنید، علاوه بر Node یک پکیج منیجر به اسم NPM نیز در اختیار شما قرار می‌گیرد که می توانید برای مدیریت پکیج های یک پروژه جاوا اسکریپتی از آن استفاده کنید.`
    },
]

export default coursesData