export default [
  {
    title: "آموزش ۲۰ کتابخانه کاربردی ReactJS برای بازارکار",
    description:
      "کتابخانه‌ها باعث افزایش سرعت کدنویسی میشن. در حدی که تو بازار کار هم از کتابخانه های مختلفی برای توسعه پروژه‌ها…",
    id: "001",
    price: 750000,
    img: "/images/20-library.png",
  },
  {
    title: "آموزش Next.js بصورت پروژه محور",
    description:
      "نکست یه فریمورک مبتنی بر ری‌اکت هست که امروزه تو بازار کار یکی از مهم‌ترین تکنولوژی‌ها برای توسعه دهنده های…",
    id: "002",
    price: 3640000,
    img: "/images/nextjs.png",
  },
  {
    title: "آموزش PWA بصورت پروژه محور",
    description:
      "کلمه PWA مخفف Progressive Web App بوده و یه تکنولوژی تقریبا جدیده که میتونیم بهمون اجازه میده وب‌سایتی که توسعه…",
    id: "003",
    price: 1776000,
    img: "/images/pwa.png",
  },
  {
    title: "آموزش تخصصی Redux مقدماتی تا پیشرفته",
    description:
      "ریداکس یه کتابخونه پراستفاده واسه مدیریت حالت های مختلف یه برنامه جاوا اسکریپتیه که تو بازار کار ری‌اکت یکی از…",
    id: "004",
    price: 1800000,
    img: "/images/redux.png",
  },
  {
    title: "آموزش ری‌اکت (ReactJS) در دنیای واقعی | از 0 تا استخدام [منتورشیپ]",
    description:
      "دوره ReactJS سبزلرن به شما یاد می‌دهد چطور برنامه‌های کاربردی وب مدرن با استفاده از React بسازید. این دوره پروژه‌محور است و از صفر تا استخدام پیش می‌رود.",
    id: "005",
    price: 6100000,
    img: "/images/reactjs.png",
  },
  {
    title: "آموزش TypeScript بصورت پروژه محور",
    description:
      "تایپ‌اسکریپت یک superset از جاوااسکریپت است که تایپینگ قوی اضافه می‌کند. این دوره به شما کمک می‌کند تا با TypeScript در پروژه‌های واقعی کار کنید.",
    id: "006",
    price: 2200000,
    img: "/images/typescript.png",
  },
];
