import "./App.css";

import { IoHome } from "react-icons/io5";
import { FaBook } from "react-icons/fa";
import { BiSupport } from "react-icons/bi";

function App() {
  return (
    <>
      <div id="navigation" class="mini-menu">
        <div class="nav-items mini">
          <button href="#" class="nav-item mini group">
            {/* <i class="fa-solid fa-house"></i> */}
            <IoHome style={{ width: "20px", height: "20px" }} />
            <div data-tooltip="tooltip" class="tooltip">
              خانه
            </div>
          </button>
          <button href="#" class="nav-item mini group">
            {/* <i class="fa-solid fa-book"></i> */}
            <FaBook style={{ width: "20px", height: "20px" }} />
            <div data-tooltip="tooltip" class="tooltip">
              دوره های آموزشی
            </div>
          </button>
          <button href="#" class="nav-item mini group">
            <i class="fa-brands fa-readme"></i>
            <div data-tooltip="tooltip" class="tooltip">
              مقالات
            </div>
          </button>
          <button href="#" class="nav-item mini group">
            <i class="fa-solid fa-chalkboard-user"></i>
            <div data-tooltip="tooltip" class="tooltip">
              منتور خصوصی
            </div>
          </button>
        </div>
        <div class="nav-items mini">
          <button href="#" class="nav-item mini group">
            {/* <i class="fa-solid fa-headset"></i> */}
            <BiSupport style={{ width: "20px", height: "20px" }} />

            <div data-tooltip="tooltip" class="tooltip">
              مشاوره اختصاصی
            </div>
          </button>

          <button href="#" class="nav-item mini group">
            <i class="fa-solid fa-arrow-right-to-bracket"></i>
            <div data-tooltip="tooltip" class="tooltip">
              ورود و ثبت نام
            </div>
          </button>
          <button href="#" class="nav-item mini group">
            <i class="fa-solid fa-up-right-and-down-left-from-center"></i>
            <div data-tooltip="tooltip" class="tooltip">
              بزرگ کردن منو
            </div>
          </button>
        </div>
      </div>

      <section id="content">
        <div class="mb-10">
          <img
            src="./public/images/banner.avif"
            class="w-full rounded-2xl"
            alt=""
          />
        </div>
        <h1 class="article-title">
          نکات مهم توسعه کامپوننت‌ها در لایبرری React.js
        </h1>

        <div class="textContent">
          <p>
            پیمان احمدی لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت
            چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه
            و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
            مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
            کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه
            و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان
            رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد
            کرد، در این صورت می توان امید داشت که تمام
          </p>
          <p>
            پیمان احمدی لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت
            چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه
            و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
            مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
            کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه
            و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان
            رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد
            کرد، لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
            استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
            ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
            و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای
            زیادی در شصت و سه درصد گذشته حال و آینده، این صورت می توان امید داشت
            که تمام
          </p>
          <p>
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
            استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
            ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
            و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای
            زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و
            متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان
            رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد
            کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
            راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل
            حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
            طراحی اساسا مورد استفاده قرار گیرد. لورم ایپسوم متن ساختگی با تولید
            سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
            چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،
            و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود
            ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و
            آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها
            شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
            فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت
            که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان
            رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات
            پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. لورم
            ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
            از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
            سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و
            کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی
            در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را
            می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
            الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
            صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
            شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
            دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا
            مورد استفاده
          </p>
        </div>
      </section>

      <div id="background">
        <div id="shapes-1"></div>
        <div class="" id="shapes-2"></div>
      </div>
    </>
  );
}

export default App;
