export default [
  {
    title: "دوره آموزش js",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط",
    price: 980_000,
    imageSrc: "/public/images/js.svg",
  },
  {
    title: "دوره آموزش node.js",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط",
    price: 890_000,
    imageSrc: "/public/images/nodejs.png",
  },
  {
    title: "دوره آموزش next.js",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط",
    price: 910_000,
    imageSrc: "/public/images/nextjs.webp",
  },
];
